Revit 2024 API
Curve.Reference Property
Returns a stable reference to the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Reference Reference { get; }
Visual Basic
Public ReadOnly Property Reference As Reference
	Get
Visual C++
public:
property Reference^ Reference {
	Reference^ get ();
}
Field Value
This value is set for curve geometry obtained from Revit elements. null if the curve was created via parameters, copying, transform, or other operations.
Remarks
This value is also if the corresponding geometry object does not permit referencing.
See Also
Curve Class
Autodesk.Revit.DB Namespace